Тест/Тест/src/InformationRegisters/ИндНомер/ИндНомер.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ИндНомер</name>
  <resources>
    <name>Код</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>наценка</name>
    <type>
      <types>CatalogRef.Коофициенты</types>
    </type>
  </resources>
  <resources>
    <name>Цена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>цп</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>дн</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>п</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </resources>
  <resources>
    <name>АвитоЧастник</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ЭтоНовыйИндКод</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>Стеллаж</name>
    <type>
      <types>CatalogRef.Стеллаж</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЦенаПроверена</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Модель</name>
    <type>
      <types>CatalogRef.МоделиАвтомобилей</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзмененияКонвеера</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьФото</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Состояние</name>
    <type>
      <types>EnumRef.Состояние</types>
    </type>
  </attributes>
  <attributes>
    <name>Поддон</name>
    <type>
      <types>CatalogRef.Поддоны</types>
    </type>
  </attributes>
  <attributes>
    <name>НоменклатураДляПоиска</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>Артикул</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>18</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Подкатегория</name>
    <type>
      <types>CatalogRef.Категории</types>
    </type>
  </attributes>
  <attributes>
    <name>КлючевыеСлова</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНаличия</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ФактНаличия</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтветственныйЗаНаличие</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>Машина</name>
    <type>
      <types>CatalogRef.Машины</types>
    </type>
  </attributes>
  <attributes>
    <name>ДетальКлиента</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Оценка</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПроверкиЕстьВНаличии</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОтветственныйЕстьВНаличии</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ВАвтозагрузкеАвито</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>индкод</name>
    <type>
      <types>CatalogRef.ИндКод</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Тест/Тест/src/Enums/дт_СостоянияЗаказовКлиента/дт_СостоянияЗаказовКлиента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>дт_СостоянияЗаказовКлиента</name>
  <enumValues>
    <name>Ожидание</name>
  </enumValues>
  <enumValues>
    <name>Думает</name>
  </enumValues>
  <enumValues>
    <name>Отказ</name>
  </enumValues>
  <enumValues>
    <name>Спам</name>
  </enumValues>
  <enumValues>
    <name>НетВНаличии</name>
  </enumValues>
  <enumValues>
    <name>Продажа</name>
  </enumValues>
  <enumValues>
    <name>Дубль</name>
  </enumValues>
  <enumValues>
    <name>Срочно</name>
  </enumValues>
  <enumValues>
    <name>ЖдёмДенег</name>
  </enumValues>
  <enumValues>
    <name>Свободная</name>
  </enumValues>
  <enumValues>
    <name>ОжидаетПриход</name>
  </enumValues>
  <enumValues>
    <name>ДругаяМарка</name>
  </enumValues>
  <enumValues>
    <name>ПропущенныйЗвонок</name>
  </enumValues>
  <enumValues>
    <name>Дорого</name>
  </enumValues>
  <enumValues>
    <name>Консультация</name>
  </enumValues>
</mdclass:Enum>

Тест/Тест/src/CommonForms/НоменклатураПовышенныйПроцент/Module.bsl
&НаКлиенте
Процедура ОбновитьОтборПартий()
	///// 
	ТекДанные = Элементы.СписокНоменклатуры.ТекущаяСтрока; 
	СписокПартий.Параметры.УстановитьЗначениеПараметра("Товар", ТекДанные);

КонецПроцедуры



&НаКлиенте
Процедура СписокНоменклатурыПриАктивизацииСтроки(Элемент)
	
	Если Элементы.СписокНоменклатуры.ТекущиеДанные <> Неопределено Тогда
		ОбновитьОтборПартий();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	ПериодПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПериодПриИзмененииНаСервере()
	
	Если ЗначениеЗаполнено(Период) Тогда 
		
		СписокНоменклатуры.Параметры.УстановитьЗначениеПараметра("Дата1", Период.ДатаНачала);
		СписокНоменклатуры.Параметры.УстановитьЗначениеПараметра("Дата2", Период.ДатаОкончания);
		ЗаполнитьПодвал(); 
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЗаполнитьПодвал(); 
КонецПроцедуры




&НаКлиенте
Процедура ОткрытьДетальНаСайте1(Команда)
	
	
	ОбщДействия.ОткрытьДетальНаСайтеWT10(ЭтаФорма.Элементы.СписокПартий.ТекущиеДанные.индкод);
		


КонецПроцедуры
	
&НаКлиенте
Процедура ОткрытьКарточкуТовараНаСайте(Команда)

	ОбщДействия.ОткрытьКарточкуТовараНаСайтеWT10(ЭтаФорма.Элементы.СписокНоменклатуры.ТекущиеДанные.Код);
	
КонецПроцедуры




&НаКлиенте
Процедура СписокПартийВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
		
		СтруктураЗаписи = Новый Структура("индкод",  ПолучитьиндКод(Элементы.СписокПартий.ТекущиеДанные.индКод));
		МассивСтруктураЗаписи = Новый Массив;
		МассивСтруктураЗаписи.Добавить(СтруктураЗаписи);
		КлючЗаписи = Новый ("РегистрСведенийКлючЗаписи.ИндНомер", МассивСтруктураЗаписи);
		
		Параметрыформы = Новый Структура("Ключ", КлючЗаписи);                            
		ОткрытьФорму("РегистрСведений.ИндНомер.ФормаЗаписи", Параметрыформы);
		
КонецПроцедуры


&НаСервереБезКонтекста
Функция ПолучитьиндКод(Код)
	Возврат Справочники.ИндКод.НайтиПоНаименованию(Код);
КонецФункции

Процедура ЗаполнитьПодвал()
	
	Схема = Элементы.СписокНоменклатуры.ПолучитьИсполняемуюСхемуКомпоновкиДанных();
	Настройки = Элементы.СписокНоменклатуры.ПолучитьИсполняемыеНастройкиКомпоновкиДанных();
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакета.Выполнить(Схема, Настройки,,,Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки);
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	Результат = ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	

	ЭтотОбъект.ЭтаФорма.Элементы.СписокНоменклатурыКоличествоПродаж.ГоризонтальноеПоложениеВПодвале = ГоризонтальноеПоложениеЭлемента.Право;
	ЭтотОбъект.ЭтаФорма.Элементы.СписокНоменклатурыСпросили.ГоризонтальноеПоложениеВПодвале = ГоризонтальноеПоложениеЭлемента.Право;
	ЭтотОбъект.ЭтаФорма.Элементы.СписокНоменклатурыЗПМенеджераНаНеЛиквид.ГоризонтальноеПоложениеВПодвале = ГоризонтальноеПоложениеЭлемента.Право;
	

	ЭтотОбъект.ЭтаФорма.Элементы.СписокНоменклатурыКоличествоПродаж.ТекстПодвала =  Формат(Результат.Итог("КоличествоПродаж"),"ЧДЦ=0; ЧН=-");
	ЭтотОбъект.ЭтаФорма.Элементы.СписокНоменклатурыСпросили.ТекстПодвала =  Формат(Результат.Итог("Спросили"),"ЧДЦ=0; ЧН=-");
	ЭтотОбъект.ЭтаФорма.Элементы.СписокНоменклатурыЗПМенеджераНаНеЛиквид.ТекстПодвала =  Формат(Результат.Итог("ЗПМенеджераНаНеЛиквид"),"ЧДЦ=0; ЧН=-");
	
КонецПроцедуры



&НаКлиенте
Процедура ДобавитьВЗаказКлиента1(Команда)
	СостоянияВРаботе = Новый Массив();
	СостоянияВРаботе.Добавить(ПредопределенноеЗначение("Перечисление.дт_СостоянияЗаказовКлиента.Продажа"));
	СостоянияВРаботе.Добавить(ПредопределенноеЗначение("Перечисление.дт_СостоянияЗаказовКлиента.Ожидание"));
	
	ПараметрыФормы = Новый Структура("РежимВыбора", Истина);
	//ПараметрыФормы.Вставить("Отбор", Новый Структура("Состояние", СостоянияВРаботе));
	
	ОткрытьФорму("Документ.ЗаказКлиента.ФормаВыбора", ПараметрыФормы, ЭтаФорма,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	ДобавитьПартиюВЗаказКлиента  = Ложь; 
	Отказ = ЛОЖЬ; 
	Если ТипЗнч(ВыбранноеЗначение) = Тип("ДокументСсылка.ЗаказКлиента") Тогда
		
		Если Элементы.СписокНоменклатуры.ТекущаяСтрока = Неопределено Тогда
			Возврат;
		КонецЕсли;	
			Партия = Новый Структура();
		Партия.Вставить("Номенклатура", Элементы.СписокНоменклатуры.ТекущаяСтрока);
		Партия.Вставить("Цена", Элементы.СписокНоменклатуры.ТекущиеДанные.Цена);
		
		/// +++ добавить партию дин.списка партия в Заказклиента// если выполняется команда из контексного меню дин.списка Партия
		Если  ДобавитьПартиюВЗаказКлиента = истина тогда  
		Попытка
		Партия.Вставить("Партия", Элементы.Партии.ТекущиеДанные.индкод);
		Исключение 
		КонецПопытки;
		КонецЕсли;
		 // ---
		ДобавитьВЗаказКлиентаНаСервере(ВыбранноеЗначение, Партия, Отказ);
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ДобавитьВЗаказКлиентаНаСервере(ДокументЗаказКлиента, Партия, Отказ)
	
	
	ДокОбъект = ДокументЗаказКлиента.ПолучитьОбъект();
	
	
	ПараметрыОтбора = Новый Структура("Номенклатура");
	ЗаполнитьЗначенияСвойств(ПараметрыОтбора, Партия);
	
	НайденныеСтроки = ДокОбъект.Товары.НайтиСтроки(ПараметрыОтбора);
	
	Если НайденныеСтроки.Количество() > 0 Тогда
		НомерСтроки = НайденныеСтроки[0].НомерСтроки;
		Партия.Вставить("НомерСтроки", НомерСтроки - 1);
		Возврат	
	КонецЕсли;
	
	НоваяСтрока = ДокОбъект.Товары.Добавить();
	ЗаполнитьЗначенияСвойств(НоваяСтрока, ПараметрыОтбора);
	Попытка
	НоваяСтрока.Партия = Партия.Партия; 
	исключение 
	КонецПопытки;
	НоваяСтрока.Количество = 1;
	
	//НоваяСтрока.Цена = Партия.Цена;
	//НоваяСтрока.Сумма = Партия.Цена;
	
	Попытка
		
		ДокОбъект.Записать();
		Партия.Вставить("НомерСтроки", НоваяСтрока.НомерСтроки - 1);
		
	Исключение
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
		СтрШаблон("Не удалось записать документ %1. %2",
		ДокОбъект,
		ОписаниеОшибки()),
		,
		,
		,
		Отказ
		);
		
	КонецПопытки;
	
КонецПроцедуры
